; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-prob-5)
  (:domain blocks)

  (:objects
    b1 - block
    b2 - block
    b3 - block
    b4 - block
    b5 - block
    b6 - block
    b7 - block
    b8 - block
  )

  (:init
    (ontable b2)
    (on b1 b2)
    (ontable b8)
    (on b7 b8)
    (ontable b4)
    (on b6 b4)
    (ontable b5)
    (ontable b3)
    (clear b1)
    (clear b7)
    (clear b6)
    (clear b5)
    (clear b3)
    (handempty)
  )

  (:goal (and
    (ontable b8)
    (on b3 b8)
    (ontable b5)
    (on b6 b5)
    (ontable b7)
    (ontable b4)
    (ontable b1)
    (ontable b2)
  ))
)

; plan
1. (unstack b6 b4)
   deleted: (clear b6) (handempty) (on b6 b4)
   added: (holding b6) (clear b4)
   goals met: 4 of 8
2. (stack b6 b5)
   deleted: (holding b6) (clear b5)
   added: (clear b6) (handempty) (on b6 b5)
   goals met: 5 of 8
3. (unstack b7 b8)
   deleted: (clear b7) (handempty) (on b7 b8)
   added: (holding b7) (clear b8)
   goals met: 5 of 8
4. (put-down b7)
   deleted: (holding b7)
   added: (clear b7) (handempty) (ontable b7)
   goals met: 6 of 8
5. (pick-up b3)
   deleted: (ontable b3) (clear b3) (handempty)
   added: (holding b3)
   goals met: 6 of 8
6. (stack b3 b8)
   deleted: (holding b3) (clear b8)
   added: (clear b3) (handempty) (on b3 b8)
   goals met: 7 of 8
7. (unstack b1 b2)
   deleted: (clear b1) (handempty) (on b1 b2)
   added: (holding b1) (clear b2)
   goals met: 7 of 8
8. (put-down b1)
   deleted: (holding b1)
   added: (clear b1) (handempty) (ontable b1)
   goals met: 8 of 8
